import pandas as pd

data = {
    'Ученики': ['Иванов', 'Петрова', 'Федоров', 'Смирнов', 'Громова', 'Демина', 'Носов'],
    'Математика': [5, 4, 5, 3, 3, 4, 5],
    'Физика':     [4, 3, 4, 3, 5, 5, 4],
    'История':    [5, 5, 3, 4, 4, 3, 4],
    'Химия':      [3, 5, 3, 1, 5, 2, 5],
}

df = pd.DataFrame(data)

print(df.head(3))
print(f"Средняя оценка по математике - {df['Математика'].mean()}")
print(f"Средняя оценка по физике - {df['Физика'].mean()}")
print(f"Средняя оценка по истории - {df['История'].mean()}")
print(f"Средняя оценка по химии - {df['Химия'].mean()}")

print(f"Медианная оценка по математике - {df['Математика'].median()}")
print(f"Медианная оценка по физике - {df['Физика'].median()}")
print(f"Медианная оценка по истории - {df['История'].median()}")
print(f"Медианная оценка по химии - {df['Химия'].median()}")

print(f"Q1 по математике - {df['Математика'].quantile(0.25)}")
print(f"Q1 по физике - {df['Физика'].quantile(0.25)}")
print(f"Q1 по истории - {df['История'].quantile(0.25)}")
print(f"Q1 по химии - {df['Химия'].quantile(0.25)}")

print(f"Q3 по математике - {df['Математика'].quantile(0.75)}")
print(f"Q3 по физике - {df['Физика'].quantile(0.75)}")
print(f"Q3 по истории - {df['История'].quantile(0.75)}")
print(f"Q3 по химии - {df['Химия'].quantile(0.75)}")

print(f"Стандартное отклонение по математике - {df['Математика'].std()}")
print(f"Стандартное отклонение по физике - {df['Физика'].std()}")
print(f"Стандартное отклонение по истории - {df['История'].std()}")
print(f"Стандартное отклонение по химии - {df['Химия'].std()}")


